import os

REDIS_URL = os.getenv("REDIS_URL", "redis://localhost:6379")
DISCORD_TOKEN = os.getenv("DISCORD_TOKEN")

ACHIEVEMENT_ROLE_IDS = [
    1543500048245981275,
    1543500112456585267,
    1543500149798473828,
]

# --- 募集機能用設定 ---
# 送信先チャンネルID
CHANNEL_TMOD = 1543542274963804220
CHANNEL_CONSOLE = 1543542426558398524
CHANNEL_VANILLA = 1543542257351790682

# 募集用ロールID（画像に基づいたロールのIDを指定してください）
ROLE_IDS = {
    "モッドマルチ": 1543544171069972500,  # ✋ | モッドマルチ希望 のロールID
    "バニラマルチ": 1543544231652491324,  # ✋ | バニラテラリアマルチ希望 のロールID
    "Switch": 1543544279627071539,       # 🖐️ | Switch のロールID
    "PS4": 1543544726412726392,          # 🕹️ | PS4 のロールID
    "XBOX": 1543544340205404211,         # ✖️ | XBOX のロールID
    "モバイル": 1543544406022426664,     # 📱 | モバイル のロールID
    "PC": 1543544445931229254,           # ⌨️ | PC のロールID
}